# ModifyingMultiGroups Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..ModifyingMultiGroups Property
BuiltInFailures..::..GroupFailures Class See Also
---
Multiple groups of the same type are being edited simultaneously outside group edit mode in an unacceptable manner.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ModifyingMultiGroups { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ModifyingMultiGroups As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ModifyingMultiGroups {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace